emacs.org
*** ~setup-go.el~
:PROPERTIES:
:CUSTOM_ID: h:64e5b918-3d56-40ba-a07f-e56294f1575a
:END:

#+begin_src emacs-lisp :tangle lisp/setup-go.el
  ;;; -*- lexical-binding: t; -*-
  (use-package go-mode
    :mode "\\.go$"
    :interpreter "go"
    :config
    (use-package company-go
      :config
      (setq company-go-show-annotation t)
      (push 'company-go company-backends))
    (setq gofmt-command "goimports")
    (if (not (executable-find "goimports"))
        (warn "go-mode: couldn't find goimports; no code formatting/fixed imports on save")
      (add-hook 'before-save-hook 'gofmt-before-save))
    (if (not (string-match "go" compile-command))   ; set compile command default
        (set (make-local-variable 'compile-command)
             "go build -v && go test -v && go vet")))

  (use-package flycheck-golangci-lint
    :hook (go-mode . flycheck-golangci-lint-setup)
    :config (setq flycheck-golangci-lint-tests t))

  (use-package dap-go
    :after dap-mode)

  (provide 'setup-go)
#+end_src

*** ~setup-hydras.el~
:PROPERTIES:
:CUSTOM_ID: h:81612e01-a0c8-42c2-a1fe-34bd1b9d8002
:END:

#+begin_src emacs-lisp :tangle lisp/setup-hydras.el
  ;;; -*- lexical-binding: t; -*-
  (defhydra hydra-goto-line (goto-map "")
    "goto-line"
    ("g" goto-line "go")
    ("m" set-mark-command "mark" :bind nil)
    ("q" nil "quit"))

  (defhydra hydra-yank-pop ()
    "yank"
    ("C-y" yank nil)
    ("M-y" yank-pop nil)
    ("y" (yank-pop 1) "next")
    ("Y" (yank-pop -1) "prev"))   ; or browse-kill-ring

  (defhydra hydra-zoom (global-map "<f2>")
    "zoom"
    ("g" text-scale-increase "in")
    ("l" text-scale-decrease "out")
    ("r" (text-scale-set 0) "reset")
    ("0" (text-scale-set 0) :bind nil :exit t)
    ("1" (text-scale-set 0) nil :bind nil :exit t))

  ;; Better shrink/enlarge windows
  (defhydra hydra-resize (global-map "<f2>")
    "resize windows"
    ("<up>" enlarge-window "enlarge")
    ("<down>" shrink-window "shrink")
    ("<left>" shrink-window-horizontally "shrink horizontaly")
    ("<right>" enlarge-window-horizontally "enlarge horizontaly"))

  (defvar hide-mode-line-mode nil)
  (defvar whitespace-mode nil)
  (defvar subword-mode nil)
  (defhydra hydra-toggle (:color pink :hint nil)
    "
  _a_ abbrev-mode:          %`abbrev-mode
  _b_ subword-mode:         %`subword-mode
  _d_ debug-on-error:       %`debug-on-error
  _h_ hide-mode-line-mode   %`hide-mode-line-mode
  _f_ auto-fill-mode:       %`auto-fill-function
  _r_ readonly-mode:        %`buffer-read-only
  _t_ truncate-lines        %`truncate-lines
  _v_ visual-line-mode:     %`visual-line-mode
  _w_ whitespace-mode:      %`whitespace-mode
  _s_ smartparens-strict:   %`smartparens-strict-mode
  _V_ visible-mode:         %`visible-mode
  "
    ("a" abbrev-mode             nil)
    ("b" subword-mode            nil)
    ("d" toggle-debug-on-error   nil)
    ("f" auto-fill-mode          nil)
    ("h" hide-mode-line-mode     nil)
    ("r" dired-toggle-read-only  nil)
    ("t" toggle-truncate-lines   nil)
    ("v" visual-line-mode        nil)
    ("V" visible-mode            nil)
    ("w" whitespace-mode         nil)
    ("s" smartparens-strict-mode nil)
    ("q" nil "quit"))

  (global-set-key (kbd "C-c C-v") 'hydra-toggle/body)

  (defhydra hydra-marked-items (dired-mode-map "")
    "
  Number of marked items: %(length (dired-get-marked-files))
  "
    ("m" dired-mark "mark"))

  (bind-key "M-y" #'hydra-yank-pop/yank-pop)
  (bind-key "C-y" #'hydra-yank-pop/yank)

  (provide 'setup-hydras)
#+end_src

*** ~setup-nix.el~
:PROPERTIES:
:CUSTOM_ID: h:f82d7d6f-55bf-495d-b71f-dd4719ece06e
:END:

#+begin_src emacs-lisp :tangle lisp/setup-nix.el
  ;;; -*- lexical-binding: t; -*-
  (use-package nix-mode
    :mode ("\\.nix\\'" "\\.nix.in\\'"))

  (use-package nix-drv-mode
    :ensure nix-mode
    :mode "\\.drv\\'")

  (use-package nix-shell
    :ensure nix-mode
    :commands (nix-shell-unpack nix-shell-configure nix-shell-build))

  (provide 'setup-nix)
#+end_src

