emacs.org
*** ~setup-style.el~
:PROPERTIES:
:CUSTOM_ID: h:3261211e-0ffb-44de-8a35-f3612d333c68
:END:

#+begin_src emacs-lisp :tangle lisp/setup-style.el
  ;;; -*- lexical-binding: t; -*-
  ;;; ¯\_(ツ)_/¯
  ;;; - Iosevka (https://github.com/be5invis/Iosevka)
  ;;; - Fira Sans (https://github.com/mozilla/Fira/)
  (setq font-height 110)
  (cond
   ((string= (system-name) "hokkaido")
    (setq font-height 100)))
  ;; Middle/Near East: שלום, السّلام عليكم
  (when (member "Noto Sans Arabic" (font-family-list))
    (set-fontset-font t 'arabic "Noto Sans Arabic"))
  (when (member "Noto Sans Hebrew" (font-family-list))
    (set-fontset-font t 'arabic "Noto Sans Hebrew"))

  ;; Africa: ሠላም
  (when (member "Noto Sans Ethiopic" (font-family-list))
    (set-fontset-font t 'ethiopic "Noto Sans Ethiopic"))

  (set-face-attribute 'default nil
                      :family "Fira Code" ; "Overpass Mono" to try someday
                      :height font-height)
  (set-face-attribute 'variable-pitch nil
                      :family "Fira Sans"
                      :height font-height
                      :weight 'regular)

  ;;; Utilities and key bindings
  (defun mu-reset-fonts ()
    "Reset fonts to my preferences."
    (interactive)
    (set-face-attribute 'default nil
                        :family "Fira Code"
                        :height font-height)
    (set-face-attribute 'variable-pitch nil
                        :family "Fira Sans"
                        :height font-height
                        :weight 'regular))

  (bind-key "C-c t f" #'mu-reset-fonts)

  ;;; Interface
  (use-package frame                      ; Frames
    :bind ("C-c w f" . toggle-frame-fullscreen)
    :init
    ;; Kill `suspend-frame'
    (unbind-key "C-x C-z")
    :config (add-to-list 'initial-frame-alist '(fullscreen . maximized)))

  (use-package emacs
    :custom
    (use-file-dialog nil)
    (use-dialog-box nil)
    (inhibit-splash-screen t)
    (echo-keystrokes 0.1) ; Faster echo keystrokes
    (line-number-display-limit-width 10000) ;; Avoid showing ?? in the mode line when we have long lines.
    (display-time-world-list '(("Europe/London" "London")
                               ("Europe/Paris" "Paris")
                               ("America/New_York" "Boston")
                               ("America/Los_Angeles" "San-Francisco")
                               ("Asia/Calcutta" "Bangalore")
                               ("Australia/Brisbane" "Brisbane")))
    :config
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (horizontal-scroll-bar-mode -1)
    (line-number-mode 1)
    (column-number-mode 1)
    (global-hl-line-mode 1)
    (global-unset-key (kbd "C-z"))
    (global-unset-key (kbd "C-x C-z"))
    (global-unset-key (kbd "C-h h")))

  ;;; Theme
  (setq custom-safe-themes t)    ; Treat themes as safe

  (use-package doom-themes
    :config
    (load-theme 'doom-one t)
    (doom-themes-visual-bell-config)
    (doom-themes-org-config))

  (use-package solaire-mode
    :config
    (setq solaire-mode-remap-modeline nil)
    (add-hook 'after-change-major-mode-hook #'turn-on-solaire-mode)
    (add-hook 'after-revert-hook #'turn-on-solaire-mode)
    (add-hook 'minibuffer-setup-hook #'solaire-mode-in-minibuffer)
    (add-hook 'ediff-prepare-buffer-hook #'solaire-mode)
    (advice-add #'persp-load-state-from-file :after #'solaire-mode-restore-persp-mode-buffers))

  ;; Show buffer position percentage starting from top
  (setq mode-line-percent-position '(-3 "%o"))
  (defvar mu-eyebrowse-mode-line
    '(:propertize
      (:eval
       (when (bound-and-true-p eyebrowse-mode)
         (let* ((num (eyebrowse--get 'current-slot))
                (tag (when num
                       (nth 2 (assoc num (eyebrowse--get 'window-configs)))))
                (str (concat
                      " "
                      (if (and tag (< 0 (length tag)))
                          tag
                        (when num (int-to-string num)))
                      " ")))
           str)))
      face (:background "#81a2be" :foreground "#373b41"))
    "Mode line format for Eyebrowse.")

  (put 'mu-eyebrowse-mode-line 'risky-local-variable t)

  (setq-default mode-line-format
                '("%e"
                  mu-eyebrowse-mode-line
                  mode-line-front-space
                  mode-line-mule-info
                  mode-line-client
                  mode-line-modified
                  mode-line-remote
                  mode-line-frame-identification
                  mode-line-buffer-identification " " mode-line-position
                  (vc-mode vc-mode)
                  (multiple-cursors-mode mc/mode-line)
                  " " mode-line-modes
                  mode-line-end-spaces))

  (defmacro rename-modeline (package-name mode new-name)
    "Rename PACKAGE-NAME with MODE into NEW-NAME in the mode line."
    `(eval-after-load ,package-name
       '(defadvice ,mode (after rename-modeline activate)
          (setq mode-name ,new-name))))

  (defun generic-term-init ()
    (visual-line-mode -1)
    (setq-local global-hl-line-mode nil)
    (setq-local scroll-margin 0))

  (add-hook 'term-mode-hook #'generic-term-init)
  (add-hook 'shell-mode-hook #'generic-term-init)
  (add-hook 'eshell-mode-hook #'generic-term-init)

  (use-package moody
    :config
    (setq x-underline-at-descent-line t)
    (moody-replace-mode-line-buffer-identification)
    (moody-replace-vc-mode))

  (use-package minions                    ; A minor-mode menu for the mode line
    :init (minions-mode)
    :config
    (setq
     minions-mode-line-lighter "λ="
     minions-direct '(flycheck-mode)))

  (setq-default indicate-buffer-boundaries 'left)
  (setq-default indicate-empty-lines +1)

  (use-package highlight
    :ensure t
    :pin melpa)

  (use-package highlight-numbers
    :hook (prog-mode . highlight-numbers-mode))

  (use-package symbol-overlay
    :defer 4
    :bind
    ("M-s h ." . symbol-overlay-put)
    ("M-s h n" . symbol-overlay-jump-next)
    ("M-s h p" . symbol-overlay-jump-prev)
    :hook (prog-mode . symbol-overlay-mode)
    :config
    (setq symbol-overlay-idle-time 0.2))

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package rainbow-mode
    :commands rainbow-mode
    :hook (prog-mode . rainbow-mode))

  (use-package visual-fill-column
    :commands visual-fill-column-mode)

  (use-package hide-mode-line-mode
    :commands hide-mode-line-mode)

  (defun set-light-theme ()
    "Set the light theme with some customization if needed."
    (interactive)
    (load-theme 'doom-one-light t))

  (defun set-dark-theme ()
    "Set the dark theme with some customization if needed."
    (interactive)
    (load-theme 'doom-one t))

  (defun theme-switcher ()
    (interactive)
    (let ((current-hour (string-to-number (format-time-string "%H"))))
      (if (and (> current-hour 6) (< current-hour 20))
          (set-light-theme)
        (set-dark-theme))))

  ;; Run at every 3600 seconds, after 0s delay
  (run-with-timer 0 3600 'theme-switcher)

  (provide 'setup-style)
#+end_src

*** ~setup-vcs.el~
:PROPERTIES:
:CUSTOM_ID: h:90edb897-d72a-4433-86c7-f6f446e9ed97
:END:

#+begin_src emacs-lisp :tangle lisp/setup-vcs.el
  ;;; -*- lexical-binding: t; -*-
  (use-package vc-hooks                   ; Simple version control
    :bind (("S-<f5>" . vc-revert)
           ("C-c v r" . vc-refresh-state))
    :config
    ;; Always follow symlinks to files in VCS repos
    (setq vc-follow-symlinks t))

  (use-package magit                      ; The best Git client out there
    :bind (("C-c v c" . magit-clone)
           ("C-c v C" . magit-checkout)
           ("C-c v d" . magit-dispatch-popup)
           ("C-c v g" . magit-blame)
           ("C-c v l" . magit-log-buffer-file)
           ("C-c v p" . magit-pull)
           ("C-c v v" . magit-status))
    :config
    (setq
     magit-save-repository-buffers 'dontask
     magit-refs-show-commit-count 'all
     magit-branch-prefer-remote-upstream '("master")
     magit-display-buffer-function #'magit-display-buffer-traditional
     magit-completing-read-function 'ivy-completing-read
     )

    (magit-define-popup-option 'magit-rebase-popup
      ?S "Sign using gpg" "--gpg-sign=" #'magit-read-gpg-secret-key)
    (magit-define-popup-switch 'magit-log-popup
      ?m "Omit merge commits" "--no-merges")

    ;; Hide "Recent Commits"
    (magit-add-section-hook 'magit-status-sections-hook
                            'magit-insert-unpushed-to-upstream
                            'magit-insert-unpushed-to-upstream-or-recent
                            'replace)

    (use-package magit-files
      :config
      (global-magit-file-mode))

    ;; Show refined hunks during diffs
    (set-default 'magit-diff-refine-hunk t)

    (add-hook 'projectile-switch-project-hook
              #'mu-magit-set-repo-dirs-from-projectile)

    ;; Refresh `magit-status' after saving a buffer
    (add-hook 'after-save-hook #'magit-after-save-refresh-status)

    ;; Free C-c C-w for Eyebrowse
    (unbind-key "C-c C-w" git-commit-mode-map)  )

  (use-package forge
    :after magit)

  (use-package magit-repos
    :after magit
    :commands magit-list-repositories
    :config
    (setq magit-repository-directories
          '(("~/src" . 3))))

  (use-package git-commit                 ; Git commit message mode
    :defer 2
    :init (global-git-commit-mode)
    :config
    (setq git-commit-summary-max-length 50)
    (setq git-commit-known-pseudo-headers
          '("Signed-off-by"
            "Acked-by"
            "Modified-by"
            "Cc"
            "Suggested-by"
            "Reported-by"
            "Tested-by"
            "Reviewed-by"))
    (setq git-commit-style-convention-checks
          '(non-empty-second-line
            overlong-summary-line))
    (remove-hook 'git-commit-finish-query-functions
                 #'git-commit-check-style-conventions))

  (use-package gitconfig-mode             ; Git configuration mode
    :defer 2)

  (use-package gitignore-mode             ; .gitignore mode
    :defer 2)

  (use-package gitattributes-mode         ; Git attributes mode
    :defer 2)

  (use-package dired-git-info
    :bind (:map dired-mode-map
                (")" . dired-git-info-mode))
    :defer 2)

  (defun git-blame-line ()
    "Runs `git blame` on the current line and
     adds the commit id to the kill ring"
    (interactive)
    (let* ((line-number (save-excursion
                          (goto-char (point-at-bol))
                          (+ 1 (count-lines 1 (point)))))
           (line-arg (format "%d,%d" line-number line-number))
           (commit-buf (generate-new-buffer "*git-blame-line-commit*")))
      (call-process "git" nil commit-buf nil
                    "blame" (buffer-file-name) "-L" line-arg)
      (let* ((commit-id (with-current-buffer commit-buf
                          (buffer-substring 1 9)))
             (log-buf (generate-new-buffer "*git-blame-line-log*")))
        (kill-new commit-id)
        (call-process "git" nil log-buf nil
                      "log" "-1" "--pretty=%h   %an   %s" commit-id)
        (with-current-buffer log-buf
          (message "Line %d: %s" line-number (buffer-string)))
        (kill-buffer log-buf))
      (kill-buffer commit-buf)))

  (provide 'setup-vcs)
#+end_src

*** ~setup-web.el~
:PROPERTIES:
:CUSTOM_ID: h:7b53ca52-4212-4b40-bb15-d320ecfcf2d5
:END:

#+begin_src emacs-lisp :tangle lisp/setup-web.el
  ;;; -*- lexical-binding: t; -*-
  (use-package web-mode
    :mode
    ("\\.html\\'" . web-mode)
    ("\\.phtml\\'" . web-mode)
    ("\\.[agj]sp\\'" . web-mode)
    ("\\.as[cp]x\\'" . web-mode)
    ("\\.erb\\'" . web-mode)
    ("\\.mustache\\'" . web-mode)
    ("\\.djhtml\\'" . web-mode)
    ("\\.jsp\\'" . web-mode)
    ("\\.eex\\'" . web-mode)
    ("\\.tsx\\'" . web-mode)
    :config
    (setq web-mode-attr-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-indent-style 2)
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-sql-indent-offset 2)
    (eval-after-load 'smartparens
      (lambda ()
        (setq web-mode-enable-auto-pairing nil)
        (sp-with-modes '(web-mode)
          (sp-local-pair "%" "%"
                         :unless '(sp-in-string-p)
                         :post-handlers '(((lambda (&rest _ignored)
                                             (just-one-space)
                                             (save-excursion (insert " ")))
                                           "SPC" "=" "#")))
          (sp-local-tag "%" "<% "  " %>")
          (sp-local-tag "=" "<%= " " %>")
          (sp-local-tag "#" "<%# " " %>")))))

  (provide 'setup-web)
#+end_src


** External libraries
:PROPERTIES:
:CUSTOM_ID: h:ce167134-1188-4ffb-9d94-61ea13440551
:END:

